Билет14/Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.ОсновныеНачисления</xr:Item>
				<xr:Item>CalculationRegister.ДопНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ОсновныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>График</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Графики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДопНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Билет14/CalculationRegisters/ОсновныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ОсновныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>false</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботы</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботы.Resource.Дней</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Билет14/InformationRegisters/СведенияОСотрудниках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОСотрудниках</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Билет14/CalculationRegisters/ДопНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ДопНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Билет14/Documents/НачислениеЗарплаты/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	НачМес	= НачалоМесяца(Дата);
	
	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Движения.ОсновныеНачисления.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыОсновныеНачисления.Подразделение КАК Подразделение,
		|	НачислениеЗарплатыОсновныеНачисления.График КАК График,
		|	НачислениеЗарплатыОсновныеНачисления.ВидРасчета КАК ВидРасчета
		|ПОМЕСТИТЬ вт_ДокТЧ
		|ИЗ
		|	Документ.НачислениеЗарплаты.ОсновныеНачисления КАК НачислениеЗарплатыОсновныеНачисления
		|ГДЕ
		|	НачислениеЗарплатыОсновныеНачисления.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ДокТЧ.Сотрудник КАК Сотрудник,
		|	вт_ДокТЧ.Подразделение КАК Подразделение,
		|	вт_ДокТЧ.График КАК График,
		|	вт_ДокТЧ.ВидРасчета КАК ВидРасчета,
		|	ЕСТЬNULL(СведенияОСотрудникахСрезПоследних.Оклад, 0) КАК Параметр
		|ИЗ
		|	вт_ДокТЧ КАК вт_ДокТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСотрудниках.СрезПоследних(
		|				&НачМес,
		|				(Сотрудник, Подразделение) В
		|					(ВЫБРАТЬ
		|						вт_ДокТЧ.Сотрудник,
		|						вт_ДокТЧ.Подразделение
		|					ИЗ
		|						вт_ДокТЧ КАК вт_ДокТЧ)) КАК СведенияОСотрудникахСрезПоследних
		|		ПО вт_ДокТЧ.Сотрудник = СведенияОСотрудникахСрезПоследних.Сотрудник
		|			И вт_ДокТЧ.Подразделение = СведенияОСотрудникахСрезПоследних.Подразделение";
	
	Запрос.УстановитьПараметр("НачМес", НачМес);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка		= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.ПериодДействияНачало = НачМес;
		Движение.ПериодДействияКонец = КонецМесяца(НачМес);
		Движение.ПериодРегистрации = НачМес;
	КонецЦикла;
	
	// регистр ДопНачисления
	Движения.ДопНачисления.Записывать = Истина;
	Движения.ДопНачисления.Записать();
	Для Каждого стр Из ДопНачисления Цикл
		Движение = Движения.ДопНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, стр);
		Движение.ПериодРегистрации = НачМес;
		Движение.БазовыйПериодНачало = НачМес;
		Движение.БазовыйПериодКонец = КонецМесяца(НачМес);
	КонецЦикла;
	
	Движения.Записать();
	
	Расчет.Рассчитать(Ссылка, НачМес);

КонецПроцедуры
